// https://school.programmers.co.kr/learn/challenges?levels=1&languages=go
package level1

// Answer is programmers/code/level1 main function
func Answer() {

	// 짝수와 홀수
	// q12397()

	// 약수의 합
	// q12928()

	// 평균 구하기
	// q12944()

	// 정수 제곱근 판별
	// q12934()

	// 자연수 뒤집어 배열로 만들기
	// q12932()

	// x만큼 간격이 있는 n개의 숫자
	// q12954()

	// 문자열을 정수로 바꾸기
	// q12925()

	// 하샤드 수
	// q12947()

	// 정수 내림차순으로 배치하기
	// q12933()

	// 나머지가 1이 되는 수 찾기
	// q87389()

	// 두 정수 사이의 합
	// q12912()

	// 콜라츠 추측
	// q12943()

	// 서울에서 김서방 찾기
	// q12919()

	// 핸드폰 번호 가리기
	// q12948()

	// 나누어 떨어지는 숫자 배열
	// q12910()

	// 제일 작은 수 제거하기
	// q12935()

	// 음양 더하기
	// q76501()

	// 없는 숫자 더하기
	// q86051()

	// 가운데 글자 가져오기
	// q12903()

	// 수박수박수박수박수박수?
	// q12922()

	// 내적
	// q70128()

	// 문자열 내림차순으로 배치하기
	// q12917()

	// 약수의 개수와 덧셈
	// q77884()
}
