package code

func Run() {
	step01()
	step02()
	step03()
	step04()
	step05()
	step06()
}

// https://www.acmicpc.net/step/1
// 입출력과 사칙연산
func step01() {
	q02557() // 01. Hello World
	q01000() // 02. A+B
	q01001() // 03. A-B
	q10998() // 04. A×B
	q01008() // 05. A/B
	q10869() // 06. 사칙연산
	q10926() // 07. ??!
	q18108() // 08. 1998년생인 내가 태국에서는 2541년생?!
	q03003() // 09. 킹, 퀸, 룩, 비숍, 나이트, 폰
	q10430() // 10. 나머지
	q02558() // 11. 곱셈
	q10171() // 12. 고양이
	q10172() // 13. 개
	q25083() // 14. 새싹
}

// https://www.acmicpc.net/step/2
// 2차원 배열
func step02() {
	q02738() // 01. 행렬 덧셈
	q02566() // 02. 최댓값
	q02563() // 03. 색종이
}

// https://www.acmicpc.net/step/3
// 반복문
func step03() {
	q02739() // 01. 구구단
	q10950() // 02. A+B - 3
	q08393() // 03. 합
	q25304() // 04. 영수증
	q15552() // 05. 빠른 A+B
	q11021() // 06. A+B - 7
	q11022() // 07. A+B - 8
	q02438() // 08. 별 찍기 - 1
	q02439() // 09. 별 찍기 - 2
	q10952() // 10. A+B - 5
	q10951() // 11. A+B - 4
	q01110() // 12. 더하기 사이클
}

// https://www.acmicpc.net/step/4
// 조건문
func step04() {
	q01330() // 01. 두 수 비교하기
	q09498() // 02. 시험 성적
	q02753() // 03. 윤년
	q14681() // 04. 사분면 고르기
	q02884() // 05. 알람 시계
	q02525() // 06. 오븐 시계
	q02480() // 07. 주사위 세개
}

// https://www.acmicpc.net/step/5
// 함수
func step05() {
	q15596() // 01. 정수 N개의 합
	q04673() // 02. 셀프 넘버
	q01065() // 03. 한수
}

// https://www.acmicpc.net/step/6
// 1차원 배열
func step06() {
	q10807() // 01. 개수 세기
	q10871() // 02. X보다 작은 수
	q10818() // 03. 최소, 최대
	q02562() // 04. 최댓값
	// q05597() // 05. 과제 안 내신 분..?
	// q03052() // 06. 나머지
	// q01546() // 07. 평균
	// q08958() // 08. OX퀴즈
	// q04344() // 09. 평균은 넘겠지
}

// q08393 is a function to solve the problem "합".
// source: https://www.acmicpc.net/problem/8393
