package code

// Answer is BaekJoon.com/code/step01 main function
// 입출력과 사칙연산
func Answer() {
	// 01. Hello World
	// q02557()

	// 02. A+B
	// q01000()

	// 03. A-B
	// q01001()

	// 04. A×B
	// q10998()

	// 05. A/B
	// q01008()

	// 06. 사칙연산
	// q10869()

	// 07. ??!
	// q10926()

	// 08. 1998년생인 내가 태국에서는 2541년생?!
	// q18108()

	// 09. 킹, 퀸, 룩, 비숍, 나이트, 폰
	// q03003()

	// 10. 나머지
	// q10430()

	// 11. 곱셈
	// q02558()

	// 12. 고양이
	// q10171()

	// 13. 개
	// q10172()

	// 14. 새싹
	// q25083()
}
